Jmi2020/HowdyScreen/components/audio_processor/src/esp32_p4_wake_word.c
#include "esp32_p4_wake_word.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include <string.h>
#include <math.h>

static const char *TAG = "ESP32P4_WakeWord";

// Wake word pattern for "Hey Howdy" (simplified energy pattern)
// Pattern represents relative energy levels across frames
static const float HEY_HOWDY_PATTERN[] = {
    0.3, 0.7, 0.4,  // "Hey" - medium start, high peak, medium end
    0.2, 0.1,       // Brief pause
    0.4, 0.8, 0.5,  // "How" - medium start, high peak, medium end  
    0.6, 0.3, 0.1   // "dy" - medium-high start, fade out
};

#define HEY_HOWDY_PATTERN_LENGTH (sizeof(HEY_HOWDY_PATTERN) / sizeof(float))
#define MIN_SYLLABLE_COUNT 2
#define MAX_SYLLABLE_COUNT 4
#define EXPECTED_SYLLABLE_COUNT 3  // "Hey-How-dy"

// Detection constants
#define MIN_DETECTION_FRAMES 10
#define MAX_DETECTION_FRAMES 30
#define ENERGY_HISTORY_SIZE 50
#define PATTERN_MATCH_THRESHOLD 0.65f
#define SYLLABLE_DETECTION_THRESHOLD 0.4f

/**
 * @brief Internal wake word detector structure
 */
typedef struct esp32_p4_wake_word_detector {
    // Configuration
    esp32_p4_wake_word_config_t config;
    
    // State
    esp32_p4_wake_word_state_t state;
    bool enabled;
    uint32_t detection_id_counter;
    
    // Audio processing
    float energy_history[ENERGY_HISTORY_SIZE];
    uint8_t energy_history_index;
    uint16_t current_energy;
    uint16_t adaptive_threshold;
    
    // Pattern matching
    float pattern_buffer[MAX_DETECTION_FRAMES];
    uint8_t pattern_buffer_index;
    uint8_t detection_frame_count;
    bool potential_wake_word;
    
    // Timing
    uint64_t last_detection_time;
    uint64_t last_process_time;
    uint64_t silence_start_time;
    
    // Conversation context
    vad_conversation_context_t conversation_context;
    uint64_t context_change_time;
    float current_tts_level;
    uint16_t context_adapted_threshold;
    bool context_suppressed;
    
    // Statistics
    esp32_p4_wake_word_stats_t stats;
    
    // Callback
    esp32_p4_wake_word_callback_t callback;
    void *callback_user_data;
    
    // Thread safety
    SemaphoreHandle_t mutex;
} esp32_p4_wake_word_detector_t;

// Forward declarations
static uint16_t calculate_audio_energy(const int16_t *audio_data, size_t sample_count);
static float calculate_pattern_match(const float *pattern_buffer, uint8_t length);
static uint8_t detect_syllables(const float *energy_pattern, uint8_t length);
static void update_adaptive_threshold(esp32_p4_wake_word_detector_t *detector, uint16_t energy);
static esp32_p4_wake_word_confidence_t calculate_confidence_level(float confidence_score);
static void apply_conversation_context_to_wake_word(esp32_p4_wake_word_detector_t *detector);

esp32_p4_wake_word_handle_t esp32_p4_wake_word_init(const esp32_p4_wake_word_config_t *config)
{
    if (!config) {
        ESP_LOGE(TAG, "Invalid configuration");
        return NULL;
    }
    
    esp32_p4_wake_word_detector_t *detector = malloc(sizeof(esp32_p4_wake_word_detector_t));
    if (!detector) {
        ESP_LOGE(TAG, "Failed to allocate memory for detector");
        return NULL;
    }
    
    memset(detector, 0, sizeof(esp32_p4_wake_word_detector_t));
    
    // Copy configuration
    detector->config = *config;
    detector->state = WAKE_WORD_STATE_LISTENING;
    detector->enabled = true;
    detector->adaptive_threshold = config->energy_threshold;
    
    // Initialize conversation context
    detector->conversation_context = VAD_CONVERSATION_IDLE; // Start in idle for wake word detection
    detector->context_change_time = esp_timer_get_time();
    detector->current_tts_level = 0.0f;
    detector->context_adapted_threshold = config->energy_threshold;
    detector->context_suppressed = false;
    
    // Initialize mutex
    detector->mutex = xSemaphoreCreateMutex();
    if (!detector->mutex) {
        ESP_LOGE(TAG, "Failed to create mutex");
        free(detector);
        return NULL;
    }
    
    // Initialize statistics
    detector->stats.current_energy_threshold = config->energy_threshold;
    detector->stats.last_detection_time = 0;
    
    ESP_LOGI(TAG, "ESP32-P4 Wake Word Detection initialized");
    ESP_LOGI(TAG, "Target phrase: 'Hey Howdy'");
    ESP_LOGI(TAG, "Energy threshold: %d", config->energy_threshold);
    ESP_LOGI(TAG, "Confidence threshold: %.2f", config->confidence_threshold);
    ESP_LOGI(TAG, "Sample rate: %lu Hz", config->sample_rate);
    
    return (esp32_p4_wake_word_handle_t)detector;
}

esp_err_t esp32_p4_wake_word_deinit(esp32_p4_wake_word_handle_t handle)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_p4_wake_word_detector_t *detector = (esp32_p4_wake_word_detector_t*)handle;
    
    if (detector->mutex) {
        vSemaphoreDelete(detector->mutex);
    }
    
    free(detector);
    
    ESP_LOGI(TAG, "ESP32-P4 Wake Word Detection deinitialized");
    return ESP_OK;
}

esp_err_t esp32_p4_wake_word_process(esp32_p4_wake_word_handle_t handle,
                                    const int16_t *audio_data,
                                    size_t sample_count,
                                    const enhanced_vad_result_t *vad_result,
                                    esp32_p4_wake_word_result_t *result)
{
    if (!handle || !audio_data || !result || sample_count == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_p4_wake_word_detector_t *detector = (esp32_p4_wake_word_detector_t*)handle;
    
    if (!detector->enabled) {
        memset(result, 0, sizeof(esp32_p4_wake_word_result_t));
        result->state = WAKE_WORD_STATE_LISTENING;
        return ESP_OK;
    }
    
    if (xSemaphoreTake(detector->mutex, pdMS_TO_TICKS(10)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }
    
    uint64_t start_time = esp_timer_get_time();
    
    // Initialize result
    memset(result, 0, sizeof(esp32_p4_wake_word_result_t));
    result->state = detector->state;
    result->detection_timestamp_ms = start_time / 1000;
    
    // Calculate audio energy
    uint16_t energy = calculate_audio_energy(audio_data, sample_count);
    detector->current_energy = energy;
    result->energy_level = energy;
    
