Jmi2020/HowdyScreen/components/audio_processor/src/esp32_p4_wake_word.c
    // Update energy history
    detector->energy_history[detector->energy_history_index] = (float)energy;
    detector->energy_history_index = (detector->energy_history_index + 1) % ENERGY_HISTORY_SIZE;
    
    // Update adaptive threshold if enabled
    if (detector->config.enable_adaptation) {
        update_adaptive_threshold(detector, energy);
    }
    
    // VAD integration
    if (vad_result) {
        result->vad_active = vad_result->voice_detected;
        result->speech_boundary_detected = vad_result->speech_started || vad_result->speech_ended;
        result->noise_floor = vad_result->noise_floor;
        result->snr_db = vad_result->snr_db;
    }
    
    // Apply conversation context to detection threshold
    apply_conversation_context_to_wake_word(detector);
    
    // Check if detection is suppressed by conversation context
    if (detector->context_suppressed) {
        // Skip processing if context suppresses wake word detection
        result->conversation_context = detector->conversation_context;
        result->context_suppressed = true;
        result->echo_suppression_applied = detector->current_tts_level;
        xSemaphoreGive(detector->mutex);
        return ESP_OK;
    }
    
    // Check if we're in a potential wake word detection
    bool above_threshold = energy > detector->context_adapted_threshold;
    bool vad_confirms = vad_result ? vad_result->voice_detected : true; // Assume voice if no VAD
    
    if (above_threshold && vad_confirms) {
        if (!detector->potential_wake_word) {
            // Start potential detection
            detector->potential_wake_word = true;
            detector->detection_frame_count = 0;
            detector->pattern_buffer_index = 0;
            ESP_LOGD(TAG, "Potential wake word detection started (energy: %d)", energy);
        }
        
        // Add to pattern buffer
        if (detector->pattern_buffer_index < MAX_DETECTION_FRAMES) {
            float normalized_energy = (float)energy / (detector->adaptive_threshold * 2.0f);
            normalized_energy = fminf(1.0f, normalized_energy); // Cap at 1.0
            detector->pattern_buffer[detector->pattern_buffer_index] = normalized_energy;
            detector->pattern_buffer_index++;
            detector->detection_frame_count++;
        }
        
        detector->silence_start_time = 0; // Reset silence timer
    } else {
        // Below threshold or VAD indicates no voice
        if (detector->potential_wake_word) {
            if (detector->silence_start_time == 0) {
                detector->silence_start_time = start_time;
            }
            
            uint64_t silence_duration = (start_time - detector->silence_start_time) / 1000;
            
            // Check if we have enough data and silence timeout
            if (detector->detection_frame_count >= MIN_DETECTION_FRAMES && 
                silence_duration > detector->config.silence_timeout_ms) {
                
                // Analyze the pattern
                float pattern_match = calculate_pattern_match(detector->pattern_buffer, 
                                                            detector->pattern_buffer_index);
                uint8_t syllable_count = detect_syllables(detector->pattern_buffer, 
                                                        detector->pattern_buffer_index);
                
                ESP_LOGD(TAG, "Pattern analysis - Match: %.3f, Syllables: %d, Frames: %d", 
                        pattern_match, syllable_count, detector->detection_frame_count);
                
                // Calculate overall confidence
                float confidence = pattern_match;
                
                // Boost confidence if syllable count matches expected
                if (syllable_count == EXPECTED_SYLLABLE_COUNT) {
                    confidence *= 1.2f; // 20% bonus for correct syllable count
                } else if (syllable_count >= MIN_SYLLABLE_COUNT && syllable_count <= MAX_SYLLABLE_COUNT) {
                    confidence *= 1.1f; // 10% bonus for reasonable syllable count
                } else {
                    confidence *= 0.8f; // Penalty for wrong syllable count
                }
                
                // VAD confidence integration
                if (vad_result && vad_result->high_confidence) {
                    confidence *= 1.1f; // Bonus for high VAD confidence
                }
                
                confidence = fminf(1.0f, confidence); // Cap at 1.0
                
                // Check if detection meets threshold
                if (confidence >= detector->config.confidence_threshold) {
                    // Wake word detected!
                    detector->state = WAKE_WORD_STATE_TRIGGERED;
                    detector->detection_id_counter++;
                    detector->last_detection_time = start_time;
                    
                    // Update statistics
                    detector->stats.total_detections++;
                    detector->stats.average_confidence = 
                        (detector->stats.average_confidence * (detector->stats.total_detections - 1) + 
                         confidence) / detector->stats.total_detections;
                    
                    // Fill result
                    result->state = WAKE_WORD_STATE_TRIGGERED;
                    result->confidence_score = confidence;
                    result->confidence_level = calculate_confidence_level(confidence);
                    result->detection_duration_ms = detector->detection_frame_count * 
                        (detector->config.frame_size * 1000 / detector->config.sample_rate);
                    result->pattern_match_score = (uint16_t)(pattern_match * 1000);
                    result->syllable_count = syllable_count;
                    result->detection_quality = (uint8_t)(confidence * 255);
                    
                    // Fill conversation context results
                    result->conversation_context = detector->conversation_context;
                    result->context_suppressed = false; // Detection succeeded despite context
                    result->echo_suppression_applied = detector->current_tts_level;
                    
