Jmi2020/HowdyScreen/components/audio_processor/src/esp32_p4_wake_word.c
                    ESP_LOGI(TAG, "🎯 Wake word 'Hey Howdy' detected! Confidence: %.2f%% (ID: %lu, Context: %s)", 
                            confidence * 100, detector->detection_id_counter,
                            detector->conversation_context == VAD_CONVERSATION_IDLE ? "idle" :
                            detector->conversation_context == VAD_CONVERSATION_LISTENING ? "listening" :
                            detector->conversation_context == VAD_CONVERSATION_SPEAKING ? "speaking" : "processing");
                    
                    // Call callback if set
                    if (detector->callback) {
                        detector->callback(result, detector->callback_user_data);
                    }
                } else {
                    ESP_LOGD(TAG, "Pattern rejected - confidence %.3f below threshold %.3f", 
                            confidence, detector->config.confidence_threshold);
                }
                
                // Reset detection state
                detector->potential_wake_word = false;
                detector->detection_frame_count = 0;
                detector->silence_start_time = 0;
            }
        }
    }
    
    // Calculate processing time
    uint64_t processing_time = esp_timer_get_time() - start_time;
    result->processing_time_us = (uint32_t)processing_time;
    
    // Update performance statistics
    detector->stats.average_processing_time_us = 
        (detector->stats.average_processing_time_us * 9 + processing_time) / 10; // Running average
    
    detector->stats.current_energy_threshold = detector->adaptive_threshold;
    detector->last_process_time = start_time;
    
    xSemaphoreGive(detector->mutex);
    
    return ESP_OK;
}

esp_err_t esp32_p4_wake_word_set_callback(esp32_p4_wake_word_handle_t handle,
                                         esp32_p4_wake_word_callback_t callback,
                                         void *user_data)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_p4_wake_word_detector_t *detector = (esp32_p4_wake_word_detector_t*)handle;
    
    if (xSemaphoreTake(detector->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        detector->callback = callback;
        detector->callback_user_data = user_data;
        xSemaphoreGive(detector->mutex);
        return ESP_OK;
    }
    
    return ESP_ERR_TIMEOUT;
}

esp_err_t esp32_p4_wake_word_server_feedback(esp32_p4_wake_word_handle_t handle,
                                            uint32_t detection_id,
                                            bool validated,
                                            uint32_t response_time_ms)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_p4_wake_word_detector_t *detector = (esp32_p4_wake_word_detector_t*)handle;
    
    if (xSemaphoreTake(detector->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        if (validated) {
            detector->state = WAKE_WORD_STATE_CONFIRMED;
            detector->stats.true_positives++;
            detector->stats.consecutive_false_positives = 0;
            ESP_LOGI(TAG, "✅ Server confirmed wake word detection (ID: %lu, response: %lums)", 
                    detection_id, response_time_ms);
            
            // Slightly reduce threshold if we're getting good detections
            if (detector->config.enable_adaptation && detector->stats.true_positives > 5) {
                uint16_t adjustment = detector->adaptive_threshold * 0.02f; // 2% reduction
                detector->adaptive_threshold = detector->adaptive_threshold > adjustment ? 
                    detector->adaptive_threshold - adjustment : detector->adaptive_threshold;
                detector->stats.threshold_adjustments++;
            }
        } else {
            detector->state = WAKE_WORD_STATE_REJECTED;
            detector->stats.false_positives++;
            detector->stats.consecutive_false_positives++;
            ESP_LOGW(TAG, "❌ Server rejected wake word detection (ID: %lu, response: %lums)", 
                    detection_id, response_time_ms);
            
            // Increase threshold if we're getting too many false positives
            if (detector->config.enable_adaptation && detector->stats.consecutive_false_positives > 2) {
                uint16_t adjustment = detector->adaptive_threshold * 0.05f; // 5% increase
                detector->adaptive_threshold += adjustment;
                detector->stats.threshold_adjustments++;
                detector->stats.consecutive_false_positives = 0; // Reset after adjustment
            }
        }
        
        // Update false positive rate
        uint32_t total_feedback = detector->stats.true_positives + detector->stats.false_positives;
        detector->stats.false_positive_rate = total_feedback > 0 ? 
            (float)detector->stats.false_positives / total_feedback : 0.0f;
        
        // Ensure threshold stays within reasonable bounds
        detector->adaptive_threshold = fmax(detector->config.energy_threshold / 2, 
                                          fmin(detector->config.energy_threshold * 3, 
                                               detector->adaptive_threshold));
        
        xSemaphoreGive(detector->mutex);
        return ESP_OK;
    }
    
    return ESP_ERR_TIMEOUT;
}

// Helper function implementations
static uint16_t calculate_audio_energy(const int16_t *audio_data, size_t sample_count)
{
    uint64_t energy_sum = 0;
    
    for (size_t i = 0; i < sample_count; i++) {
        int32_t sample = audio_data[i];
        energy_sum += (uint32_t)(sample * sample);
    }
    
    // Return RMS energy scaled to 16-bit range
    uint32_t rms_energy = (uint32_t)sqrt(energy_sum / sample_count);
    return (uint16_t)fmin(65535, rms_energy);
}

static float calculate_pattern_match(const float *pattern_buffer, uint8_t length)
{
    if (length < MIN_DETECTION_FRAMES) {
        return 0.0f;
    }
    
    // Simple correlation with expected "Hey Howdy" pattern
    float correlation = 0.0f;
    uint8_t comparison_length = fmin(length, HEY_HOWDY_PATTERN_LENGTH);
    
