Jmi2020/HowdyScreen/components/audio_processor/src/esp32_p4_wake_word.c
    // Calculate normalized cross-correlation
    float pattern_energy = 0.0f;
    float buffer_energy = 0.0f;
    
    for (uint8_t i = 0; i < comparison_length; i++) {
        pattern_energy += HEY_HOWDY_PATTERN[i] * HEY_HOWDY_PATTERN[i];
        buffer_energy += pattern_buffer[i] * pattern_buffer[i];
        correlation += HEY_HOWDY_PATTERN[i] * pattern_buffer[i];
    }
    
    if (pattern_energy > 0 && buffer_energy > 0) {
        correlation /= sqrt(pattern_energy * buffer_energy);
        correlation = fmax(0.0f, correlation); // Only positive correlation
    }
    
    return correlation;
}

static uint8_t detect_syllables(const float *energy_pattern, uint8_t length)
{
    if (length < 3) {
        return 0;
    }
    
    uint8_t syllable_count = 0;
    bool in_syllable = false;
    
    for (uint8_t i = 0; i < length; i++) {
        if (energy_pattern[i] > SYLLABLE_DETECTION_THRESHOLD) {
            if (!in_syllable) {
                syllable_count++;
                in_syllable = true;
            }
        } else {
            in_syllable = false;
        }
    }
    
    return syllable_count;
}

static void update_adaptive_threshold(esp32_p4_wake_word_detector_t *detector, uint16_t energy)
{
    // Simple adaptive threshold based on noise floor estimation
    static uint64_t last_update = 0;
    uint64_t now = esp_timer_get_time();
    
    // Update every 5 seconds
    if (now - last_update > 5000000) {
        // Calculate average background energy
        float avg_energy = 0.0f;
        for (int i = 0; i < ENERGY_HISTORY_SIZE; i++) {
            avg_energy += detector->energy_history[i];
        }
        avg_energy /= ENERGY_HISTORY_SIZE;
        
        // Set threshold as multiple of background noise
        uint16_t noise_based_threshold = (uint16_t)(avg_energy * 2.5f);
        
        // Smooth adjustment
        detector->adaptive_threshold = 
            (detector->adaptive_threshold * 0.9f) + (noise_based_threshold * 0.1f);
        
        // Keep within bounds
        detector->adaptive_threshold = fmax(detector->config.energy_threshold / 3,
                                          fmin(detector->config.energy_threshold * 4,
                                               detector->adaptive_threshold));
        
        last_update = now;
    }
}

static esp32_p4_wake_word_confidence_t calculate_confidence_level(float confidence_score)
{
    if (confidence_score >= 0.86f) {
        return WAKE_WORD_CONFIDENCE_VERY_HIGH;
    } else if (confidence_score >= 0.71f) {
        return WAKE_WORD_CONFIDENCE_HIGH;
    } else if (confidence_score >= 0.41f) {
        return WAKE_WORD_CONFIDENCE_MEDIUM;
    } else {
        return WAKE_WORD_CONFIDENCE_LOW;
    }
}

// Helper function to apply conversation context to wake word detection
static void apply_conversation_context_to_wake_word(esp32_p4_wake_word_detector_t *detector)
{
    if (!detector->config.conversation.enable_context_awareness) {
        detector->context_adapted_threshold = detector->adaptive_threshold;
        detector->context_suppressed = false;
        return;
    }
    
    uint16_t threshold_adjustment = 100; // Default 100% (no change)
    bool suppress_detection = false;
    
    switch (detector->conversation_context) {
        case VAD_CONVERSATION_IDLE:
            // Boost sensitivity for wake word detection in idle state
            threshold_adjustment = 100 - detector->config.conversation.idle_sensitivity_boost;
            break;
            
        case VAD_CONVERSATION_LISTENING:
            // Normal sensitivity during active conversation
            threshold_adjustment = 100;
            // Allow wake word during conversation if configured
            suppress_detection = !detector->config.conversation.enable_during_conversation;
            break;
            
        case VAD_CONVERSATION_SPEAKING:
            // Reduced sensitivity during TTS with echo suppression
            threshold_adjustment = 100 + detector->config.conversation.speaking_suppression;
            
            // Additional suppression based on TTS level
            if (detector->current_tts_level > 0.1f) {
                float tts_suppression = detector->current_tts_level * 
                    (detector->config.conversation.echo_rejection_db / 20.0f);
                threshold_adjustment += (uint16_t)(tts_suppression * 50); // Up to 50% additional suppression
            }
            break;
            
        case VAD_CONVERSATION_PROCESSING:
        default:
            // Normal behavior during processing
            threshold_adjustment = 100;
            break;
    }
    
    // Apply threshold adjustment
    detector->context_adapted_threshold = (detector->adaptive_threshold * threshold_adjustment) / 100;
    detector->context_suppressed = suppress_detection;
    
    ESP_LOGV(TAG, "Wake word context adaptation - Context: %d, Threshold: %d->%d, Suppressed: %s",
            detector->conversation_context, 
            detector->adaptive_threshold,
            detector->context_adapted_threshold,
            suppress_detection ? "YES" : "NO");
}

// Additional API implementations
esp_err_t esp32_p4_wake_word_get_default_config(esp32_p4_wake_word_config_t *config)
{
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }
    
    config->sample_rate = 16000;
    config->frame_size = 320;              // 20ms frames
    config->energy_threshold = 3500;       // Moderate sensitivity
    config->confidence_threshold = 0.65f;  // 65% confidence required
    config->silence_timeout_ms = 2000;     // 2 second timeout
    config->pattern_frames = 20;           // Analyze 20 frames max
    config->consistency_frames = 3;        // Require 3 consistent frames
    config->enable_adaptation = true;      // Enable adaptive thresholds
    config->adaptation_rate = 0.05f;       // 5% adaptation rate
    
    // Conversation-aware settings
    config->conversation.enable_context_awareness = true;   // Enable conversation context
    config->conversation.idle_sensitivity_boost = 20;      // 20% boost in idle state
    config->conversation.speaking_suppression = 40;        // 40% suppression during TTS
    config->conversation.echo_rejection_db = 12;           // 12dB echo rejection
    config->conversation.enable_during_conversation = true; // Allow wake word during conversation
    
    config->processing_interval_ms = 20;   // 20ms processing interval
    config->max_detections_per_min = 10;   // Max 10 detections per minute
    
    return ESP_OK;
}

esp_err_t esp32_p4_wake_word_get_stats(esp32_p4_wake_word_handle_t handle,
                                      esp32_p4_wake_word_stats_t *stats)
{
    if (!handle || !stats) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_p4_wake_word_detector_t *detector = (esp32_p4_wake_word_detector_t*)handle;
    
    if (xSemaphoreTake(detector->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        *stats = detector->stats;
        xSemaphoreGive(detector->mutex);
        return ESP_OK;
    }
    
