Jmi2020/HowdyScreen/components/audio_processor/src/esp32_p4_wake_word.c
    return ESP_ERR_TIMEOUT;
}

bool esp32_p4_wake_word_is_listening(esp32_p4_wake_word_handle_t handle)
{
    if (!handle) {
        return false;
    }
    
    esp32_p4_wake_word_detector_t *detector = (esp32_p4_wake_word_detector_t*)handle;
    return detector->enabled && detector->state == WAKE_WORD_STATE_LISTENING;
}

esp_err_t esp32_p4_wake_word_enable(esp32_p4_wake_word_handle_t handle, bool enable)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_p4_wake_word_detector_t *detector = (esp32_p4_wake_word_detector_t*)handle;
    detector->enabled = enable;
    
    if (enable) {
        detector->state = WAKE_WORD_STATE_LISTENING;
    }
    
    ESP_LOGI(TAG, "Wake word detection %s", enable ? "enabled" : "disabled");
    return ESP_OK;
}

esp32_p4_wake_word_state_t esp32_p4_wake_word_get_state(esp32_p4_wake_word_handle_t handle)
{
    if (!handle) {
        return WAKE_WORD_STATE_LISTENING;
    }
    
    esp32_p4_wake_word_detector_t *detector = (esp32_p4_wake_word_detector_t*)handle;
    return detector->state;
}

esp_err_t esp32_p4_wake_word_update_thresholds(esp32_p4_wake_word_handle_t handle,
                                              uint16_t new_energy_threshold,
                                              float new_confidence_threshold)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_p4_wake_word_detector_t *detector = (esp32_p4_wake_word_detector_t*)handle;
    
    if (xSemaphoreTake(detector->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        // Validate threshold ranges
        if (new_energy_threshold > 0 && new_energy_threshold < 32768) {
            detector->config.energy_threshold = new_energy_threshold;
            detector->adaptive_threshold = new_energy_threshold;
            ESP_LOGI(TAG, "Updated energy threshold to %d", new_energy_threshold);
        }
        
        if (new_confidence_threshold >= 0.1f && new_confidence_threshold <= 1.0f) {
            detector->config.confidence_threshold = new_confidence_threshold;
            ESP_LOGI(TAG, "Updated confidence threshold to %.2f", new_confidence_threshold);
        }
        
        // Update statistics
        detector->stats.threshold_adjustments++;
        detector->stats.current_energy_threshold = detector->adaptive_threshold;
        
        xSemaphoreGive(detector->mutex);
        return ESP_OK;
    }
    
    return ESP_ERR_TIMEOUT;
}

esp_err_t esp32_p4_wake_word_set_conversation_context(esp32_p4_wake_word_handle_t handle,
                                                    vad_conversation_context_t context)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_p4_wake_word_detector_t *detector = (esp32_p4_wake_word_detector_t*)handle;
    
    if (xSemaphoreTake(detector->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        if (detector->conversation_context != context) {
            ESP_LOGI(TAG, "Wake word conversation context changed: %s -> %s",
                    detector->conversation_context == VAD_CONVERSATION_IDLE ? "idle" :
                    detector->conversation_context == VAD_CONVERSATION_LISTENING ? "listening" :
                    detector->conversation_context == VAD_CONVERSATION_SPEAKING ? "speaking" : "processing",
                    context == VAD_CONVERSATION_IDLE ? "idle" :
                    context == VAD_CONVERSATION_LISTENING ? "listening" :
                    context == VAD_CONVERSATION_SPEAKING ? "speaking" : "processing");
            
            detector->conversation_context = context;
            detector->context_change_time = esp_timer_get_time();
            
            // Reset TTS level when leaving speaking state
            if (context != VAD_CONVERSATION_SPEAKING) {
                detector->current_tts_level = 0.0f;
            }
        }
        
        xSemaphoreGive(detector->mutex);
        return ESP_OK;
    }
    
    return ESP_ERR_TIMEOUT;
}

vad_conversation_context_t esp32_p4_wake_word_get_conversation_context(esp32_p4_wake_word_handle_t handle)
{
    if (!handle) {
        return VAD_CONVERSATION_IDLE;
    }
    
    esp32_p4_wake_word_detector_t *detector = (esp32_p4_wake_word_detector_t*)handle;
    return detector->conversation_context;
}

esp_err_t esp32_p4_wake_word_set_tts_level(esp32_p4_wake_word_handle_t handle, 
                                          float tts_level)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    
    esp32_p4_wake_word_detector_t *detector = (esp32_p4_wake_word_detector_t*)handle;
    
    // Clamp TTS level to valid range
    tts_level = fmaxf(0.0f, fminf(1.0f, tts_level));
    
    if (xSemaphoreTake(detector->mutex, pdMS_TO_TICKS(50)) == pdTRUE) {
        if (fabsf(detector->current_tts_level - tts_level) > 0.1f) { // Only log significant changes
            ESP_LOGD(TAG, "Wake word TTS level updated: %.2f -> %.2f", 
                    detector->current_tts_level, tts_level);
        }
        
        detector->current_tts_level = tts_level;
        
        // Automatically set context to speaking when TTS is active
        if (tts_level > 0.1f && detector->conversation_context != VAD_CONVERSATION_SPEAKING) {
            detector->conversation_context = VAD_CONVERSATION_SPEAKING;
            detector->context_change_time = esp_timer_get_time();
        }
        
        xSemaphoreGive(detector->mutex);
        return ESP_OK;
    }
    
    return ESP_ERR_TIMEOUT;
}

esp_err_t esp32_p4_wake_word_get_conversation_config(esp32_p4_wake_word_config_t *config)
{
    if (!config) {
        return ESP_ERR_INVALID_ARG;
    }
    
    // Start with default configuration
    esp_err_t ret = esp32_p4_wake_word_get_default_config(config);
    if (ret != ESP_OK) {
        return ret;
    }
    
    // Optimize for conversation flow
    config->confidence_threshold = 0.68f;           // Slightly higher confidence for conversation
    config->silence_timeout_ms = 1800;             // Faster timeout for conversation flow
    config->consistency_frames = 4;                // More consistency required
    config->max_detections_per_min = 15;           // Allow more frequent detections in conversation
    
    // Enhanced conversation-aware settings
    config->conversation.enable_context_awareness = true;
    config->conversation.idle_sensitivity_boost = 25;      // 25% boost in idle state
    config->conversation.speaking_suppression = 50;        // 50% suppression during TTS  
    config->conversation.echo_rejection_db = 15;           // Stronger echo rejection
    config->conversation.enable_during_conversation = true; // Enable "Hey Howdy" during conversation
    
    ESP_LOGI(TAG, "Generated conversation-optimized wake word configuration");
    ESP_LOGI(TAG, "Idle boost: %d%%, TTS suppression: %d%%, Echo rejection: %ddB", 
            config->conversation.idle_sensitivity_boost,
            config->conversation.speaking_suppression,
            config->conversation.echo_rejection_db);
    
    return ESP_OK;
}